RU/Ext/Henrik Rusche/ShapeOptCases/run/optimisation/rampPressure/system/rbfMotionDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          rbfMotionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

movingPatches
(
    bottomRamp
);

controlPoints
(
    // Moving points

    // Back plane
    (  4  0.75  -0.1)
    (  5  0.5   -0.1)
    (  6  0.25  -0.1)
    // Front plane
    (  4  0.75   0.1)
    (  5  0.5    0.1)
    (  6  0.25   0.1)

    // Box points

    // Back plane
    (  3   2   -0.1)
    (  3   3   -0.1)
    (  3   4   -0.1)
    (  7   0   -0.1)
    (  7   1   -0.1)
    (  7   2   -0.1)
    (  7   3   -0.1)
    (  7   4   -0.1)
    (  4   4   -0.1)
    (  5   4   -0.1)
    (  6   4   -0.1)
    // Front plane
    (  3   2    0.1)
    (  3   3    0.1)
    (  3   4    0.1)
    (  7   0    0.1)
    (  7   1    0.1)
    (  7   2    0.1)
    (  7   3    0.1)
    (  7   4    0.1)
    (  4   4    0.1)
    (  5   4    0.1)
    (  6   4    0.1)
);


motionBounds
(
    // Moving points

    // Back plane
    (( -0.5  -0.35 0) ( 0.5   0.55 0))
    (( -0.75 -0.5 0) ( 0.75  0.75 0))
    (( -0.5  -0.45 0) ( 0.5   0.25 0))
    // Front plane
    (( -0.5  -0.35 0) ( 0.5   0.55 0))
    (( -0.75 -0.5 0) ( 0.75  0.75 0))
    (( -0.5  -0.45 0) ( 0.5   0.25 0))

    // Box points

    // Back plane
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    //
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    //
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))

    // Front plane
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    //
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    //
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
    (( 0 0 0) (0 0 0))
);

nSteps 5;

interpolation
{
    RBF  IMQB;

    focalPoint (5 0.5 0);
    innerRadius 1;
    outerRadius 3.5;
    polynomials off;


    TPSCoeffs
    {
        radius     5.0;
    }
    GaussCoeffs
    {
        radius        0.8;
    }
    IMQBCoeffs
    {
        radius       1;
    }
}


// ************************************************************************* //
